## Pandas Day- 17

### Pandas sort_values() & sort_index()
- **sort_values()** sorts data by column values, while sort_index() sorts by index.

In [1]:
import pandas as pd

### Creating Sample DataFrame

In [2]:
df = pd.DataFrame({
    "Name": ["Amit", "Rahul", "Neha", "Priya"],
    "Age": [21, 22, 20, 23],
    "Marks": [85, 78, 90, 88]
})

In [3]:
df

    Name  Age  Marks
0   Amit   21     85
1  Rahul   22     78
2   Neha   20     90
3  Priya   23     88

### Sort by Single Column

In [4]:
df.sort_values("Marks")

    Name  Age  Marks
1  Rahul   22     78
0   Amit   21     85
3  Priya   23     88
2   Neha   20     90

### Sort in Descending Order

In [5]:
df.sort_values("Marks", ascending=False)

    Name  Age  Marks
2   Neha   20     90
3  Priya   23     88
0   Amit   21     85
1  Rahul   22     78

### Sort by Multiple Columns

In [6]:
df.sort_values(["Age", "Marks"])

    Name  Age  Marks
2   Neha   20     90
0   Amit   21     85
1  Rahul   22     78
3  Priya   23     88

### Sort Index

In [8]:
df.sort_index()

    Name  Age  Marks
0   Amit   21     85
1  Rahul   22     78
2   Neha   20     90
3  Priya   23     88

### Sort Index in Descending Order

In [9]:
df.sort_index(ascending=False)

    Name  Age  Marks
3  Priya   23     88
2   Neha   20     90
1  Rahul   22     78
0   Amit   21     85